:-dynamic император/6.
:-dynamic супруга_императора/4.
:-dynamic наследник_императора/4.

император("Пётр рррррррррррррррI",российская_империя,[1],1672,1725,16345).
император("Пётр II",российская_империя,[2],1693,1730,9540).
император("Иван VI",российская_империя,[3],1740,1764,11565).
император("Пётр III",российская_империя,[4],1728,1762,13440).
император("Павел I",российская_империя,[5],1754, 1801,12225).
император("Александр I",российская_империя,[6],1777,1825,14355).
император("Николай I",российская_империя,[7],1796,1855,14775).
император("Александр II",российская_империя,[8],1818,1881,19475).
император("Александр III",российская_империя,[9],1845,1894,17775).
император("Николай II",российская_империя,[10],1868,1917,7775).

супруга_императора("Екатерина I","Пётр I",1672,1735).
супруга_императора("Ксения","Пётр II",1720,1746).
супруга_императора("Анастасия","Иван VI",1746,1777).
супруга_императора("Елизавета","Пётр III",1735,1778).
супруга_императора("София","Павел I",1759,1804).
супруга_императора("Даръя","Александр I",1785,1840).
супруга_императора("Мария","Николай I",1803,1856).
супруга_императора("Марианна","Александр II",1830,1880).
супруга_императора("Анна","Александр III",1850,1906).
супруга_императора("Юлия","Николай II",1870,1915).

наследник_императора("Пётр II","Пётр I",1693,1730).
наследник_императора("Елизавета Петровна","Пётр II",1740,1764).
наследник_императора("Пётр III","Иван VI",1728,1762).
наследник_императора("Павел I","Пётр III",1754, 1801).
наследник_императора("Александр I","Павел I",1777,1825).
наследник_императора("Николай I","Александр I",1796,1855).
наследник_императора("Александр II","Николай I",1818,1881).
наследник_императора("Александр III","Александр II",1845,1894).
наследник_императора("Николай II","Александр III",1868,1917).
наследник_императора("Георгий Александрович","Николай II",1871,1999).